# Задание 1
# Пользователь вводит с клавиатуры три цифры.
# Необ- ходимо создать число, содержащее эти цифры. 
# Например, если с клавиатуры введено 1, 5, 7,
# тогда нужно сформи- ровать число 157.


# name1 = input("Введіть цифру №1 : ")
# name2 = input("Введіть цифру №2 : ")
# name3 = input("Введіть цифру №3 : ")
# print("Отримане число :" + name1 + name2 + name3)

# Задание 2
# Пользователь вводит с клавиатуры число, 
# состоящее из четырех цифр.
# Требуется найти произведение цифр. 
# Например, если с клавиатуры введено 1324,
# тогда резуль- тат произведения 1*3*2*4 = 24.



# n = int(input("Введіть чотиризначне число : "))
# prod = 1
# while n > 0:
#     digit = n % 10
#     prod *= digit
#     n //= 10
# print("Добуток зазначених чисел :", prod)




# Задание 3
# Пользователь вводит с клавиатуры количество метров. 
# Требуется вывести результат перевода метров в сантиме- 
# тры, дециметры, миллиметры, мили.


# meter = float(input('Количество метров: '))
# print(f'{meter} метров = {meter*10} дециметров')
# print(f'{meter} метров = {meter*100} сантиметров')  
# print(f'{meter} метров = {meter*1000} миллиметров')
# print(f'{meter} метров = {meter/1609} миль')


# Задание 4
# Напишите программу, 
# вычисляющую площадь тре- угольника. 
# Пользователь с клавиатуры вводит размер основания
# треугольника и размер высоты.

# a= int(input("Довжина основи трикутника: " ))
# h= int(input("Висота трикутника: " ))
# print ("S :",a*h)
 


# Задание 5
# Пользователь с клавиатуры вводит четырёхзначное число.
# Необходимо перевернуть число и отобразить результат. 
# Например, если введено 4512, результат 2154.



# n1= int(input("Введить чысло:"))
# n2=0
# while n1>0:
#     digital=n1%10
#     print(digital)
#     n1//=10
#     print(n1)
#     n2*=10
#     n2+=digital
#     print(n2)
