# Задание 1
# Напишите функцию, вычисляющую произведение элементов списка целых.
# Список передаётся в качестве па- раметра. Полученный результат возвращается из функции.





# Задание 2
# Напишите функцию для нахождения минимума в списке целых.
# Список передаётся в качестве параметра. Полученный результат возвращается из функции.





# Задание 3
# Напишите функцию, определяющую количество про- стых чисел в списке целых.
# Список передаётся в качестве параметра. Полученный результат возвращается из функции.




# Задание 4
# Напишите функцию, удаляющую из списка целых некоторое заданное число. 
# Из функции нужно вернуть количество удаленных элементов.




# Задание 5
# Напишите функцию, которая получает два списка в 
# качестве параметра и возвращает список, содержащий элементы обоих списков.





# Задание 6
# Напишите функцию, высчитывающую степень каждого элемента списка целых.
# Значение для степени передаётся в качестве параметра, список тоже передаётся в качестве параметра. 
# Функция возвращает новый список, содержа- щий полученные результаты.