# Задание 1
# Пользователь вводит с клавиатуры два числа (нача- ло и конец диапазона). 
# Требуется проанализировать все числа в этом диапазоне по следующему правилу:
# если число кратно 7, его надо выводить на экран.


# a = int(input("Початок: "))
# b = int(input("Кінець: "))
# i=a
# print("число кратне 7")
# while i <= b :
#     if i % 7 == 0:
#         print(i, end = " ")
#     i+=1


# a = int(input("Початок: "))
# b = int(input("Кінець: "))
# i=a
# print("число кратне 7")
# for i in range(a,b+1):
#     if i % 7 == 0:
#         print(i, end=" ")


# a = int(input("Початок: "))
# b = int(input("Кінець: "))

# print("число кратне 7")
# while a <= b :
#     if a % 7 == 0:
#         print(a, end = " ")
#     a+=1
   



# Задание 2
# Пользователь вводит с клавиатуры два числа (нача- ло и конец диапазона). 
# Требуется проанализировать все числа в этом диапазоне. Нужно вывести на экран:
# 1. Все числа диапазона;
# 2. Все числа диапазона в убывающем порядке; 
# 3. Все числа, кратные 7;
# 4. Количество чисел, кратных 5.


# a = int(input("Початок: "))
# b = int(input("Кінець: "))

# print( "\nВсі числа діапазону: ")
# i=a
# while i < b :
#     print(i, end = " ")
#     i+=1
    
# print("\nВсі числа діапазону в спадному порядку : ")
# i=b
# while i>=a:
#     print(i,end = " ")
#     i-=1

# print("\nЧисла кратні 7")
# i=a
# while i <= b :
#     if i % 7 == 0:
#         print(i, end = " ")
#     i+=1

# print("\nКількість чисел кратних 5")
# i=a
# count=0
# while i <= b :
#     if i % 5 == 0:
#         count+=1
#     i+=1
# print(count)


    




# Задание 3
# Пользователь вводит с клавиатуры два числа (начало и конец диапазона). 
# Требуется проанализировать все числа в этом диапазоне.
#  Вывод на экран должен проходить по правилам, указанным ниже.
# Если число кратно 3 (делится на 3 без остатка) нужно вывести слово Fizz.
#  Если число кратно 5 нужно выве-
#  сти слово Buzz. Если число кратно 3 и 5 нужно вывести Fizz Buzz. 
# Если число не кратно не 3 и 5 нужно вывести само число.


# number1 = int (input ('Введіть число №1'))
# number2 = int (input ('Введіть число №2'))
# for i in range(number1,number2+1):
#     if i%3 ==0 and i%5 ==0 :
#         print ('Fizz Buzz')
#     elif  i % 3 ==0:
#         print("Fizz") 
#     elif  i%5 ==0:
#         print("Buzz")
#     else:
#         if i %3 != 0 and i% 5 !=0:
#             print(i)



# number1 = int (input ('Введіть число №1: '))
# number2 = int (input ('Введіть число №2 :'))
# i = number1
# while i<=number2:
#     if i%3 ==0 and i%5 ==0 :
#         print ('Fizz Buzz')
#     elif  i % 3 ==0:
#         print("Fizz")
#     elif  i%5 ==0:
#         print("Buzz")
#     else:
#         i %3 != 0 and i% 5 !=0 
#         print(i)
#     i+=1

